app/controllers/students_controller.rb

  def index

    @grade_category = params[:grade_category]
    @grade = params[:grade]

    if @grade == nil && @grade_category != nil
      @students = Student.grade(@grade_category).order(:yomi)
---
SELECT "students".* FROM "students" WHERE (grade like '中１') ORDER BY yomi

  def show
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE ("students"."id" = 1) LIMIT 1

  def edit
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE ("students"."id" = 2) LIMIT 1

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("created_at", "first_name", "first_name_y", "grade", "last_name", "last_name_y", "updated_at") VALUES ('2010-10-19 06:33:35.956825', NULL, NULL, NULL, NULL, NULL, '2010-10-19 06:33:35.956825')

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT "students".* FROM "students" WHERE ("students"."id" = 1) LIMIT 1
UPDATE "students" SET "grade" = '中３', "name" = '清水諒', "updated_at" = '2010-10-19 07:29:48.680476', "yomi" = 'シミズマコト' WHERE ("students"."id" = 1)

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT "students".* FROM "students" WHERE ("students"."id" = 1) LIMIT 1
DELETE FROM "students" WHERE ("students"."id" = 1)